In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [5]:
df=pd.read_csv('AirPassengers.csv')
df.head()

        Month  Passengers
0  15-01-1949         112
1  15-02-1949         118
2  15-03-1949         132
3  15-04-1949         129
4  15-05-1949         121

In [6]:
df.tail()

          Month  Passengers
139  15-08-1960         606
140  15-09-1960         508
141  15-10-1960         461
142  15-11-1960         390
143  15-12-1960         432

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Month       144 non-null    object
 1   Passengers  144 non-null    int64
dtypes: int64(1), object(1)
memory usage: 2.4+ KB